name: "AlexNet"
layer {
  name: "data"
  type: "EvalData"
  top: "data"
  top: "gt_boxes"
  top: "image_sizes"
  transform_param {
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  eval_data_param {
    root_folder: "/your/path/to/VOCdevkit/"
    source: "../../../data/voc/window_file_voc07_test.txt"
    batch_size: 1
    short_size: 600
    long_size: 1000
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    pad: 5
    stride: 4
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}

#========================== rpn ===============================
layer {
  name: "rpn_conv"
  type: "Convolution"
  bottom: "conv5"
  top: "rpn_conv"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 512
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_relu"
  type: "ReLU"
  bottom: "rpn_conv"
  top: "rpn_conv"
}
layer {
  name: "rpn_cls"
  type: "Convolution"
  bottom: "rpn_conv"
  top: "rpn_cls"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 18
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "rpn_cls_reshape"
  bottom: "rpn_cls"
  top: "rpn_cls_reshape"
  type: "Reshape"
  reshape_param { 
    shape { dim: -1 dim: 2 dim: 0 dim: 0 } 
  }
}
layer {
  name: "rpn_bbox"
  type: "Convolution"
  bottom: "rpn_conv"
  top: "rpn_bbox"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 36
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "rpn_bbox_reshape"
  bottom: "rpn_bbox"
  top: "rpn_bbox_reshape"
  type: "Reshape"
  reshape_param { 
    shape { dim: -1 dim: 4 dim: 0 dim: 0 } 
  }
}

#=================== proposal ======================
layer {
  name: "rpn_prob_reshape"
  type: "Softmax"
  bottom: "rpn_cls_reshape"
  top: "rpn_prob_reshape"
  softmax_param {
    axis: 1
  }
}
layer {
  name: "proposals"
  type: "BoxGroupOutput"
  bottom: "rpn_prob_reshape"
  bottom: "rpn_bbox_reshape"
  top: "proposals"
  box_group_output_param {
    fg_thr: 0.05
    iou_thr: 0.7
    nms_type: "IOU"
    box_group_param {
      field_w: 176
      field_w: 88
      field_w: 128
      field_w: 352
      field_w: 176
      field_w: 256
      field_w: 704
      field_w: 352
      field_w: 512
      field_h: 88
      field_h: 176
      field_h: 128
      field_h: 176
      field_h: 352
      field_h: 256
      field_h: 352
      field_h: 704
      field_h: 512
      stride: 16
    }
    field_whr: 8
    field_xyr: 1
    max_nms_num: 5000
    max_post_nms_num: 300
  }
  propagate_down: 0
  propagate_down: 0
}
#=================== RCNN ======================
layer {
  name: "roi_pool"
  type: "ROIPooling"
  bottom: "conv5"
  bottom: "proposals"
  top: "roi_pool"
  roi_pooling_param {
    pooled_w: 6
    pooled_h: 6
    spatial_scale: 0.0625 # 1/16
    pad_ratio: 0
  }
  propagate_down: 1
  propagate_down: 0
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "roi_pool"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "cls_pred"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_pred"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 21
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc7"
  top: "bbox_pred"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 8
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
#-----------------------output------------------------
layer {
  name: "cls_prob"
  type: "Softmax"
  bottom: "cls_pred"
  top: "cls_prob"
  softmax_param {
    axis: 1
  }
}
layer {
  name: "frcnn_out"
  type: "FrcnnOutput"
  bottom: "cls_prob"
  bottom: "bbox_pred"
  bottom: "proposals"
  bottom: "image_sizes"
  top: "frcnn_out"
  include {
    phase: TEST
  }
  frcnn_output_param {
    conf_thr: 0.01
    iou_thr: 0.3
    nms_type: "IOU"
    #max_det_num: 200
  }
  bbox_reg_param {
    cls_aware: false
    bbox_mean: 0 bbox_mean: 0 bbox_mean: 0 bbox_mean: 0
    bbox_std: 0.1 bbox_std: 0.1 bbox_std: 0.2 bbox_std: 0.2
  }
}
layer {
  name: "detection_eval_05"
  type: "DetectionEvaluate"
  bottom: "frcnn_out"
  bottom: "gt_boxes"
  bottom: "image_sizes"
  top: "detection_eval_05"
  include {
    phase: TEST
  }
  detection_evaluate_param {
    num_classes: 21
    overlap_threshold: 0.5
    evaluate_difficult_gt: false
    name_size_file: "../../../data/voc/voc07_test_name_size.txt"
  }
}
layer {
  name: "detection_eval_06"
  type: "DetectionEvaluate"
  bottom: "frcnn_out"
  bottom: "gt_boxes"
  bottom: "image_sizes"
  top: "detection_eval_06"
  include {
    phase: TEST
  }
  detection_evaluate_param {
    num_classes: 21
    overlap_threshold: 0.6
    evaluate_difficult_gt: false
    name_size_file: "../../../data/voc/voc07_test_name_size.txt"
  }
}
layer {
  name: "detection_eval_07"
  type: "DetectionEvaluate"
  bottom: "frcnn_out"
  bottom: "gt_boxes"
  bottom: "image_sizes"
  top: "detection_eval_07"
  include {
    phase: TEST
  }
  detection_evaluate_param {
    num_classes: 21
    overlap_threshold: 0.7
    evaluate_difficult_gt: false
    name_size_file: "../../../data/voc/voc07_test_name_size.txt"
  }
}
layer {
  name: "detection_eval_08"
  type: "DetectionEvaluate"
  bottom: "frcnn_out"
  bottom: "gt_boxes"
  bottom: "image_sizes"
  top: "detection_eval_08"
  include {
    phase: TEST
  }
  detection_evaluate_param {
    num_classes: 21
    overlap_threshold: 0.8
    evaluate_difficult_gt: false
    name_size_file: "../../../data/voc/voc07_test_name_size.txt"
  }
}
layer {
  name: "detection_eval_09"
  type: "DetectionEvaluate"
  bottom: "frcnn_out"
  bottom: "gt_boxes"
  bottom: "image_sizes"
  top: "detection_eval_09"
  include {
    phase: TEST
  }
  detection_evaluate_param {
    num_classes: 21
    overlap_threshold: 0.9
    evaluate_difficult_gt: false
    name_size_file: "../../../data/voc/voc07_test_name_size.txt"
  }
}
